docs/tracking/principles/EFFECTFUL_COMPUTATION_ON_PROPAGATORS.tex
% Created 2026-03-06 Fri 12:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{The Prologos Project - from Zachary Larson}
\date{2026-03-06}
\title{Effectful Computation on Propagators: The Layered Recovery Principle}
\hypersetup{
 pdfauthor={The Prologos Project - from Zachary Larson},
 pdftitle={Effectful Computation on Propagators: The Layered Recovery Principle},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{The Fundamental Limit}
\label{sec:org3cb0145}

Propagator networks compute monotone fixed points on lattice-valued cells.
Information only grows; values only refine. This is the source of their power
--- convergence is guaranteed, parallelism is safe, and partial information is
first-class.

But IO effects are not monotone. Writing to a file, printing to a console,
opening a network connection --- these are \emph{irreversible observations} that
produce side effects in the world. They cannot be undone, retried, or merged.
The CALM theorem (Hellerstein 2011) formalizes this: non-monotonic operations
require coordination. You cannot achieve confluence for effectful computation
without synchronization.

This creates a tension. Prologos uses propagator networks as its computation
substrate. Session types specify protocols that include IO effects. The
propagator network must somehow handle effects that violate its fundamental
monotonicity assumption.

\textbf{The question is not whether coordination is needed --- it is --- but where
coordination is placed, and how much of the reasoning about effects can remain
monotone.}
\section{The Insight: Layered Recovery}
\label{sec:orgeeb642d}

The solution is not to extend propagators with non-monotone operations.
It is to \emph{layer} a control mechanism on top of the monotone substrate, so
that:

\begin{itemize}
\item \textbf{Reasoning about effects} (what effects exist, in what order, with what
dependencies) happens monotonically in the propagator network
\item \textbf{Executing effects} (performing the actual IO) happens at a control boundary,
sequentially, after the monotone reasoning reaches a fixed point
\end{itemize}

This is the \textbf{Layered Recovery Principle}:

\begin{quote}
Non-monotone behavior is recovered on a monotone substrate by inserting control
layers between phases of monotone computation. The control layers perform the
non-monotone operations (effect execution, negation evaluation, choice
commitment) at precisely the points where coordination is required.
\end{quote}

This principle is not specific to IO effects. It is the general mechanism by
which Prologos extends the propagator substrate to handle any non-monotone
domain.
\section{The Precedent: Logic Engine}
\label{sec:org3934151}

The first application of Layered Recovery in Prologos is the logic engine
(\texttt{rel}), which recovers non-monotone logical operations on the propagator
substrate:

\begin{center}
\begin{tabular}{rll}
Layer & Component & Role\\
\hline
1 & Propagator Network & Monotone constraint propagation (unification)\\
2 & ATMS & Hypothetical reasoning (choice points)\\
3 & Stratification Controller & Non-monotone operations (negation, cut)\\
\end{tabular}
\end{center}

\begin{itemize}
\item \textbf{Layer 1} handles the monotone core: unification constraints propagate through
cells, values refine, the network converges.
\item \textbf{Layer 2} (ATMS) manages alternative worldviews. Each choice point creates an
assumption; the ATMS tracks which combinations of assumptions are consistent
(and which are nogoods). This is still monotone --- adding nogoods only
shrinks the set of valid worldviews.
\item \textbf{Layer 3} is the stratification barrier. Negation (\texttt{\textbackslash{}+} in Prolog) is
non-monotone: "P is not provable" can become false if P is later derived.
Stratification resolves this by dividing the program into strata, computing
each stratum to a fixed point before evaluating negation that references
lower strata. The barrier between strata is the coordination point.
\end{itemize}

The key observation: Layers 1 and 2 are entirely monotone and live within the
propagator network. Layer 3 is the \emph{minimal} non-monotone extension, placed
at exactly the boundary required by the CALM theorem. The logic engine doesn't
abandon the propagator model --- it \emph{layers} control on top of it.

See: \texttt{docs/tracking/2026-02-24\_LOGIC\_ENGINE\_DESIGN.org} §5 (Three-Layer
Architecture), Appendix B (Stratification).
\section{The Application: Session-Derived Effect Ordering}
\label{sec:org4e5fb17}

The second application of Layered Recovery handles IO effects. The insight that
unlocks it: \emph{session types are causal clocks}. Each position in a session type's
continuation chain is a causally-ordered event. The ordering is not imposed
externally --- it is \textbf{intrinsic} to the session type's structure.
