docs/tracking/principles/EFFECTFUL_COMPUTATION_ON_PROPAGATORS.tex
\subsection{Session Types as Causal Clocks}
\label{sec:org73b94e7}

A session type \texttt{!String . ?Int . end} encodes three positions:

\begin{verbatim}
Position 0: send a String    (happens first)
Position 1: recv an Int      (happens second)
Position 2: end              (happens last)
\end{verbatim}

Session advancement --- the monotone process of advancing a session cell from
one protocol state to the next --- is a \emph{Lamport clock}. Each advancement ticks
the clock forward. For multiple channels, the per-channel clocks form a \emph{vector
clock}: operations on different channels are concurrent (incomparable in the
partial order), while operations on the same channel are totally ordered.

This is the same causal structure that distributed systems use for ordering
events, but derived from the \emph{type system} rather than assigned at runtime.
Session fidelity (a theorem of the session type system) guarantees that effects
respect this ordering.
\subsection{The Galois Connection}
\label{sec:org880c6c3}

The formal bridge between sessions and effects is a Galois connection:

\begin{verbatim}
 (alpha, gamma)
alpha : Session -> EffectPosition      (extract causal position from session state)
gamma : EffectPosition -> Session      (reconstruct remaining protocol from position)
\end{verbatim}

Both functions are monotone. The adjunction guarantees soundness: session
fidelity implies effect ordering correctness. At a deeper level, both the
session lattice and the effect position lattice are \emph{effect quantales} ---
lattice-ordered monoids with sequential composition --- and the Galois
connection is a quantale morphism preserving both ordering and composition.

This formalizes why session types can serve as the foundation for effect
ordering: the algebraic structure is shared. The connection is not accidental;
it reflects a deep mathematical relationship between protocols and effects.

See: \texttt{docs/tracking/2026-03-06\_SESSION\_TYPES\_AS\_EFFECT\_ORDERING.org} §4 (Galois
Connection), §6 (Effect Quantale Connection).
\subsection{Cross-Channel Data Dependencies}
\label{sec:org6cdfc43}

Session types provide per-channel ordering but not cross-channel ordering.
When a value received on channel \texttt{a} flows to a send on channel \texttt{b}, there
is a data dependency that the session types alone don't capture.

The resolution: compute the \textbf{transitive closure} of the union of session
ordering edges and data-flow edges. Transitive closure is a monotone
operation on sets of edges --- adding an edge never removes existing ordering
relationships. This means a propagator can incrementally compute the complete
partial order:

\begin{verbatim}
Session edges:    (a0 < a1), (b0 < b1)           (from session types)
Data-flow edge:   (a0 < b0)                       (x flows from recv a to send b)
Transitive close: (a0 < a1), (b0 < b1), (a0 < b0), (a0 < b1)
\end{verbatim}

The transitive closure is a monotone fixed point. It lives natively in the
propagator network. No external scheduling is needed.
\subsection{The Five-Layer Architecture}
\label{sec:org4b1f51e}

The full architecture for effectful computation on propagators:

\begin{verbatim}
Layer 1: Session Advancement              [exists -- session-runtime.rkt]
    Session cells advance monotonically through session types.
    Each advancement is a causal clock tick for that channel.

Layer 2: Data-Flow Analysis               [NEW]
    Analyze variable bindings to derive cross-channel ordering edges.
    recv x a -> send [f x] b  ==>  ordering edge (a_pos < b_pos)

Layer 3: Transitive Closure               [NEW]
    Compute the complete partial order by propagating ordering edges
    to their transitive closure. Monotone fixed-point computation.
    Concurrent effects remain unordered (least commitment).

Layer 4: ATMS Branching                   [exists -- atms.rkt]
    Maintain per-branch ordering hypotheses for proc-case.
    Resolve when branch is chosen; discard inconsistent worldviews.

Layer 5: Effect Handler                   [NEW]
    Read the resolved partial order. Execute effects in any valid
    linearization. This is the only non-monotone step (actual IO).
\end{verbatim}

Layers 1--4 are monotone. Layer 5 is the control boundary --- the precise
point where the CALM theorem requires coordination.
