docs/tracking/principles/EFFECTFUL_COMPUTATION_ON_PROPAGATORS.md


<a id="orgaebe4a2"></a>

## Session Types as Causal Clocks

A session type `!String . ?Int . end` encodes three positions:

```
Position 0: send a String    (happens first)
Position 1: recv an Int      (happens second)
Position 2: end              (happens last)
```

Session advancement &#x2014; the monotone process of advancing a session cell from one protocol state to the next &#x2014; is a *Lamport clock*. Each advancement ticks the clock forward. For multiple channels, the per-channel clocks form a *vector clock*: operations on different channels are concurrent (incomparable in the partial order), while operations on the same channel are totally ordered.

This is the same causal structure that distributed systems use for ordering events, but derived from the *type system* rather than assigned at runtime. Session fidelity (a theorem of the session type system) guarantees that effects respect this ordering.


<a id="org0ca3af2"></a>

## The Galois Connection

The formal bridge between sessions and effects is a Galois connection:

```
 (alpha, gamma)
alpha : Session -> EffectPosition      (extract causal position from session state)
gamma : EffectPosition -> Session      (reconstruct remaining protocol from position)
```

Both functions are monotone. The adjunction guarantees soundness: session fidelity implies effect ordering correctness. At a deeper level, both the session lattice and the effect position lattice are *effect quantales* &#x2014; lattice-ordered monoids with sequential composition &#x2014; and the Galois connection is a quantale morphism preserving both ordering and composition.

This formalizes why session types can serve as the foundation for effect ordering: the algebraic structure is shared. The connection is not accidental; it reflects a deep mathematical relationship between protocols and effects.

See: `docs/tracking/2026-03-06_SESSION_TYPES_AS_EFFECT_ORDERING.org` §4 (Galois Connection), §6 (Effect Quantale Connection).


<a id="org6f44828"></a>

## Cross-Channel Data Dependencies

Session types provide per-channel ordering but not cross-channel ordering. When a value received on channel `a` flows to a send on channel `b`, there is a data dependency that the session types alone don't capture.

The resolution: compute the **transitive closure** of the union of session ordering edges and data-flow edges. Transitive closure is a monotone operation on sets of edges &#x2014; adding an edge never removes existing ordering relationships. This means a propagator can incrementally compute the complete partial order:

```
Session edges:    (a0 < a1), (b0 < b1)           (from session types)
Data-flow edge:   (a0 < b0)                       (x flows from recv a to send b)
Transitive close: (a0 < a1), (b0 < b1), (a0 < b0), (a0 < b1)
```

The transitive closure is a monotone fixed point. It lives natively in the propagator network. No external scheduling is needed.


<a id="org3452426"></a>

## The Five-Layer Architecture

The full architecture for effectful computation on propagators:

```
Layer 1: Session Advancement              [exists -- session-runtime.rkt]
    Session cells advance monotonically through session types.
    Each advancement is a causal clock tick for that channel.

Layer 2: Data-Flow Analysis               [NEW]
    Analyze variable bindings to derive cross-channel ordering edges.
    recv x a -> send [f x] b  ==>  ordering edge (a_pos < b_pos)

Layer 3: Transitive Closure               [NEW]
    Compute the complete partial order by propagating ordering edges
    to their transitive closure. Monotone fixed-point computation.
    Concurrent effects remain unordered (least commitment).

Layer 4: ATMS Branching                   [exists -- atms.rkt]
    Maintain per-branch ordering hypotheses for proc-case.
    Resolve when branch is chosen; discard inconsistent worldviews.

Layer 5: Effect Handler                   [NEW]
    Read the resolved partial order. Execute effects in any valid
    linearization. This is the only non-monotone step (actual IO).
```

Layers 1&#x2013;4 are monotone. Layer 5 is the control boundary &#x2014; the precise point where the CALM theorem requires coordination.
