docs/tracking/principles/EFFECTFUL_COMPUTATION_ON_PROPAGATORS.tex
\section{The \texttt{rel\textasciitilde{}/\textasciitilde{}proc} Parallel}
\label{sec:orga17b511}

The pattern reveals a deep structural parallel between Prologos's two
computational engines:

\begin{center}
\begin{tabular}{lll}
Dimension & \texttt{rel} (Logic Engine) & \texttt{proc} (Session Runtime)\\
\hline
\textbf{Variables} & Logic variables (unification cells) & Session cells (protocol state)\\
\textbf{Constraints} & Equality constraints (type/term) & Ordering constraints (causal)\\
\textbf{Propagation} & Unification propagators & Session advancement + ordering propagators\\
\textbf{Fixed point} & Constraint closure (all equalities) & Ordering closure (transitive causal edges)\\
\textbf{Hypotheses} & ATMS worldviews (choice points) & ATMS worldviews (branch alternatives)\\
\textbf{Resolution} & Evidence selects worldview & Received value selects worldview\\
\textbf{Execution} & Proof terms (constructive evidence) & Effects (IO operations in causal order)\\
\textbf{Control layer} & Stratification (negation evaluation) & Effect handler (IO execution)\\
\end{tabular}
\end{center}

Both engines share the three-layer architecture: Propagator Network (monotone
fixed points) + ATMS (hypothetical reasoning) + Control Layer (non-monotone
operations). The Layered Recovery Principle is the \emph{common theory} underlying
both.

This parallel is not coincidental. Both \texttt{rel} and \texttt{proc} face the same
fundamental challenge: how to perform non-monotone operations (negation for
\texttt{rel}; effects for \texttt{proc}) on a monotone substrate (propagator network). Both
solve it the same way: reason monotonically about the non-monotone domain, then
execute the non-monotone operations at a control barrier after the monotone
reasoning converges.
\section{What This Means: Designing for the Principle}
\label{sec:orgcd6a137}

The Layered Recovery Principle is a design methodology, not just an observation.
When extending Prologos to handle a new domain that involves non-monotone
operations:

\begin{enumerate}
\item \textbf{Identify the monotone core}: What can be reasoned about convergently?
For effects, it's ordering relationships. For logic, it's unification
constraints. For type inference, it's subtyping relationships.

\item \textbf{Encode the monotone core in the propagator network}: Define lattices,
cells, and propagators for the convergent reasoning. This gets parallelism,
incrementality, and partial-information handling for free.

\item \textbf{Identify the non-monotone boundary}: What operations require
coordination? For effects, it's execution. For logic, it's negation. This
is where the CALM theorem demands synchronization.

\item \textbf{Insert a control layer at the boundary}: The control layer reads the
fixed point of the monotone core and performs the non-monotone operations
in a coordinated fashion.

\item \textbf{Use the ATMS for hypothetical reasoning}: If the domain involves
alternatives (choice points, branches, speculative evaluation), the ATMS
manages the hypotheses monotonically.
\end{enumerate}

This methodology has now been applied successfully to two domains (logic,
effects) and the consistent results suggest it will generalize to others.
\section{The Architecture Decision: A + D}
\label{sec:org24f402c}

Two architectures for effect ordering:

\begin{itemize}
\item \textbf{Architecture A (Stratified Barriers)}: Effects execute in AST walk order.
Sequential, simple, correct by construction. No propagator involvement in
ordering. This is the current implementation for \texttt{main} and top-level
REPL expressions.

\item \textbf{Architecture D (Session-Derived Ordering)}: Effects are ordered by session
type structure via the Galois connection. Cross-channel dependencies resolved
by transitive closure. Branches handled by ATMS. The ordering is a theorem
from session fidelity, not a design choice.
\end{itemize}

The recommended architecture is \textbf{A + D}:

\begin{itemize}
\item \textbf{D} for session-typed IO (the structured, common case). Ordering is derived
from session types, verified by the type checker, and compositional across
protocol phases. Concurrent effects on independent channels are correctly
unordered (least commitment).

\item \textbf{A} for unsessioned IO (the REPL, top-level eval, \texttt{main} without explicit
sessions). Walk-based ordering is simple and sufficient.
\end{itemize}

Architecture A is, in fact, a \textbf{degenerate case} of Architecture D: \texttt{main} with
sequential IO and no explicit session is equivalent to a process with a single
implicit session. As \texttt{main} gains explicit session structure, D's richer
ordering semantics apply automatically.

Architecture B (Timestamped Effect Cells) is \textbf{subsumed}: for session-typed
effects, D provides strictly more information (intrinsic, verified ordering);
for unsessioned effects, A is simpler. B adds nothing that A + D don't provide.
