docs/tracking/principles/EFFECTFUL_COMPUTATION_ON_PROPAGATORS.tex
\section{Relationship to Other Principles}
\label{sec:org9f2b300}

\begin{center}
\begin{tabular}{ll}
Document & Relationship\\
\hline
\texttt{DESIGN\_PRINCIPLES.org} & "Correctness Through Types" --- effect ordering is derived from session types (correctness is a theorem). "Layered Architecture" --- Layers 5/6 (session/process) are where effect ordering operates.\\
\texttt{PROTOCOLS\_AS\_TYPES.org} & Session type composition (protocol libraries) composes effect orderings automatically. Capability composition tracks alongside protocol and effect composition.\\
\texttt{LANGUAGE\_VISION.org} & "Protocol correctness" extends to effect correctness. "Session types as protocol specifications" gains causal clock interpretation.\\
\texttt{CAPABILITY\_SECURITY.md} & \texttt{SysCap} as powerbox for \texttt{main} (Architecture A fallback). Capability requirements compose with session phases and their effect orderings.\\
\texttt{RELATIONAL\_LANGUAGE\_VISION.org} & The logic engine (\texttt{rel}) is the first application of Layered Recovery. The structural parallel between \texttt{rel} and \texttt{proc} confirms the principle's generality.\\
IO Implementation PIR & §4a ("Propagators Cannot Order Side Effects") is the discovery that motivated this principle. The PIR documents the empirical observation; this document provides the theoretical resolution.\\
\end{tabular}
\end{center}
\section{Implications for the Language}
\label{sec:org4c85e35}

\subsection{Effect Ordering Is a Type-System Property}
\label{sec:org1c3c54c}

With Architecture D, the ordering of IO effects is not a scheduler decision
or a compiler implementation detail. It is a \textbf{property of the type system}.
The session type determines the ordering; the type checker verifies it; the
compiler derives it via the Galois connection. Users can reason about effect
ordering by reading the session type --- the same way they reason about protocol
correctness.
\subsection{Concurrent Effects Fall Out Naturally}
\label{sec:org3258c99}

For multi-channel processes, effects on independent channels are concurrent ---
the partial order leaves them unordered. This means the runtime can execute
them in parallel or in any interleaving, without violating correctness. The
session type system guarantees that these effects are on independent resources
(different channels, verified by linearity). Concurrency is not opt-in; it's
the default for independent effects.
\subsection{Static Deadlock Detection}
\label{sec:org504549f}

The transitive closure computation for cross-channel data dependencies can
detect cycles (\texttt{A < B < A}), which indicate deadlocks. This turns runtime
deadlocks into compile-time errors. The ordering analysis serves double duty:
it provides effect ordering \emph{and} deadlock detection for data-dependent
cross-channel interactions.
\subsection{The CALM Optimality}
\label{sec:org24a4831}

The architecture achieves the minimum coordination required by the CALM theorem.
All reasoning about effects (ordering, dependencies, alternatives) is monotone
and coordination-free. The only coordination point is the final effect execution
barrier (Layer 5). This is provably optimal --- no architecture can eliminate
this barrier without violating the CALM theorem.
\section{Theoretical Foundations}
\label{sec:orgda49677}

\subsection{CALM Theorem (Hellerstein 2011)}
\label{sec:org7493866}

The Consistency And Logical Monotonicity theorem: a distributed program has a
consistent, coordination-free implementation if and only if it is monotonic.
IO effects are non-monotonic, so coordination is required. The Layered Recovery
Principle minimizes this coordination to a single barrier.
\subsection{Propagator Networks (Radul \& Sussman 2009)}
\label{sec:orgdb9b339}

Monotone fixed-point computation on lattice-valued cells. The computational
substrate for Prologos. Propagator designers explicitly excluded non-commutative
effects from the model --- the Layered Recovery Principle is our answer to this
exclusion.
\subsection{Session Types (Caires \& Pfenning 2010, Wadler 2012)}
\label{sec:org74eeca2}

Session types as linear logic propositions via Curry-Howard. The continuation
structure of a session type encodes the causal ordering of communication events.
Session fidelity guarantees that implementations respect this ordering.
\subsection{Galois Connections}
\label{sec:orga9a9a9a}

An adjunction \texttt{(\textbackslash{}alpha, \textbackslash{}gamma)} between ordered domains. Used throughout abstract
interpretation (Cousot \& Cousot) for soundly approximating one domain in terms
of another. Our use connects the session lattice to the effect position lattice.
\subsection{Vector Clocks (Lamport 1978, Fidge/Mattern 1988)}
\label{sec:orga87232b}

Per-process Lamport clocks composed into vectors for partial ordering of events
in distributed systems. Per-channel session depths composed into vectors for
partial ordering of effects across channels. The mathematical structure is
identical.
