docs/tracking/principles/EFFECTFUL_COMPUTATION_ON_PROPAGATORS.tex
\subsection{Partial Order Planning (Weld 1994)}
\label{sec:orgc510ee4}

Least-commitment planning with causal links and ordering constraints. Effect
ordering via transitive closure is isomorphic to POP: data-flow edges are
causal links, session ordering is initial constraints, \texttt{proc-case} is plan
alternatives, ATMS is threat postponement.
\subsection{Effect Quantales (Katsumata 2014, Gordon 2021)}
\label{sec:org7445308}

Lattice-ordered monoids with sequential composition that distribute over joins.
Both session types and effect positions form effect quantales. The Galois
connection is a quantale morphism preserving this algebraic structure.
\subsection{Category-Graded Monads (Katsumata, Orchard et al.)}
\label{sec:org3300b4d}

Unifies graded monads (effect systems) and parameterised monads (session types)
into a single categorical framework. The Galois connection between sessions
and effects is, categorically, a functor between indexing categories.
\section{Inspirations}
\label{sec:orgf70071c}

\begin{itemize}
\item \textbf{Hellerstein} (CALM theorem) --- The theoretical foundation for why
coordination is necessary and where it must be placed.
\item \textbf{Radul \& Sussman} (Propagators) --- The computational substrate. Their
explicit exclusion of non-commutative effects is the challenge we resolve.
\item \textbf{Caires \& Pfenning} (Session types as linear logic) --- The Curry-Howard
foundation that makes session types causal clocks.
\item \textbf{Lamport} (Logical clocks) --- Session advancement IS a Lamport clock.
The connection is direct, not analogical.
\item \textbf{de Kleer} (ATMS) --- Hypothetical reasoning for branching alternatives.
The same ATMS serves both \texttt{rel} and \texttt{proc}.
\item \textbf{Weld} (Partial Order Planning) --- The least-commitment principle for
ordering: don't impose unnecessary ordering on concurrent effects.
\item \textbf{Atkey} (Parameterised monads) --- Session types as pre/post state indices.
Sequential composition = bind matching postcondition to precondition.
\item \textbf{The Prologos Logic Engine} --- The first application of Layered Recovery,
which established the three-layer architecture and demonstrated that
non-monotone operations can be recovered on a monotone substrate.
\end{itemize}
\end{document}
